reports/koa.txt
cpu info: Intel(R) Xeon(R) CPU E3-1230 V2 @ 3.30GHz
node version: v7.7.3
---------0 middlewares---------
Method -- GET: 
2888 requests done.
5945 requests done.
9193 requests done.
12349 requests done.
15538 requests done.
18634 requests done.
21751 requests done.
25053 requests done.
28183 requests done.
All requests done.

Summary:
  Total:	4.7787 secs
  Slowest:	0.0300 secs
  Fastest:	0.0005 secs
  Average:	0.0080 secs
  Requests/sec:	6277.8634
  Total data:	330000 bytes
  Size/request:	11 bytes

Status code distribution:
  [200]	30000 responses

Response time histogram:
  0.000 [1]	|
  0.003 [7]	|
  0.006 [44]	|
  0.009 [27135]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.012 [998]	|∎
  0.015 [921]	|∎
  0.018 [851]	|∎
  0.021 [8]	|
  0.024 [21]	|
  0.027 [3]	|
  0.030 [11]	|

Latency distribution:
  10% in 0.0070 secs
  25% in 0.0070 secs
  50% in 0.0075 secs
  75% in 0.0080 secs
  90% in 0.0090 secs
  95% in 0.0140 secs
  99% in 0.0160 secs

Method -- POST: 
2753 requests done.
5915 requests done.
9014 requests done.
12180 requests done.
15290 requests done.
18580 requests done.
21684 requests done.
24805 requests done.
27824 requests done.
All requests done.

Summary:
  Total:	4.8437 secs
  Slowest:	0.0280 secs
  Fastest:	0.0035 secs
  Average:	0.0081 secs
  Requests/sec:	6193.5633
  Total data:	330000 bytes
  Size/request:	11 bytes

Status code distribution:
  [200]	30000 responses

Response time histogram:
  0.004 [1]	|
  0.006 [7]	|
  0.008 [22965]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.011 [4995]	|∎∎∎∎∎∎∎∎∎
  0.013 [476]	|∎
  0.016 [1048]	|∎∎
  0.018 [379]	|∎
  0.021 [68]	|
  0.023 [41]	|
  0.026 [14]	|
  0.028 [6]	|

Latency distribution:
  10% in 0.0070 secs
  25% in 0.0070 secs
  50% in 0.0075 secs
  75% in 0.0080 secs
  90% in 0.0095 secs
  95% in 0.0135 secs
  99% in 0.0165 secs

---------10 middlewares---------
Method -- GET: 
2726 requests done.
5755 requests done.
8909 requests done.
11848 requests done.
14853 requests done.
17983 requests done.
21022 requests done.
24104 requests done.
27221 requests done.
All requests done.

Summary:
  Total:	4.9637 secs
  Slowest:	0.0250 secs
  Fastest:	0.0005 secs
  Average:	0.0083 secs
  Requests/sec:	6043.9030
  Total data:	330000 bytes
  Size/request:	11 bytes

Status code distribution:
  [200]	30000 responses

Response time histogram:
  0.001 [1]	|
  0.003 [3]	|
  0.005 [2]	|
  0.008 [18129]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.010 [9352]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.013 [524]	|∎
  0.015 [1675]	|∎∎∎∎
  0.018 [291]	|∎
  0.020 [1]	|
  0.023 [8]	|
  0.025 [14]	|

Latency distribution:
  10% in 0.0070 secs
  25% in 0.0075 secs
  50% in 0.0075 secs
  75% in 0.0085 secs
  90% in 0.0100 secs
  95% in 0.0140 secs
  99% in 0.0155 secs

Method -- POST: 
2850 requests done.
5793 requests done.
8729 requests done.
11848 requests done.
14813 requests done.
17776 requests done.
20864 requests done.
23863 requests done.
26836 requests done.
29839 requests done.
All requests done.

Summary:
  Total:	5.0290 secs
  Slowest:	0.0230 secs
  Fastest:	0.0005 secs
  Average:	0.0084 secs
  Requests/sec:	5965.4556
  Total data:	330000 bytes
  Size/request:	11 bytes

Status code distribution:
  [200]	30000 responses

Response time histogram:
  0.001 [1]	|
  0.003 [1]	|
  0.005 [12]	|
  0.007 [4198]	|∎∎∎∎∎∎∎∎
  0.010 [21656]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.012 [1930]	|∎∎∎∎
  0.014 [927]	|∎∎
  0.016 [1229]	|∎∎
  0.019 [24]	|
  0.021 [5]	|
  0.023 [17]	|

Latency distribution:
  10% in 0.0070 secs
  25% in 0.0075 secs
  50% in 0.0075 secs
  75% in 0.0085 secs
  90% in 0.0100 secs
  95% in 0.0135 secs
  99% in 0.0150 secs

---------100 middlewares---------
Method -- GET: 
2172 requests done.
4534 requests done.
6954 requests done.
9428 requests done.
11715 requests done.
14146 requests done.
16431 requests done.
18861 requests done.
21129 requests done.
23569 requests done.
25886 requests done.
28311 requests done.
All requests done.

Summary:
  Total:	6.3758 secs
  Slowest:	0.0250 secs
  Fastest:	0.0010 secs
  Average:	0.0106 secs
  Requests/sec:	4705.3047
  Total data:	330000 bytes
  Size/request:	11 bytes

Status code distribution:
  [200]	30000 responses

Response time histogram:
  0.001 [1]	|
  0.003 [8]	|
  0.006 [3]	|
  0.008 [8]	|
  0.011 [20327]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.013 [7710]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.015 [1401]	|∎∎∎
  0.018 [418]	|∎
  0.020 [94]	|
  0.023 [19]	|
  0.025 [11]	|

Latency distribution:
  10% in 0.0095 secs
  25% in 0.0095 secs
  50% in 0.0100 secs
  75% in 0.0120 secs
  90% in 0.0125 secs
  95% in 0.0135 secs
  99% in 0.0165 secs

Method -- POST: 
2235 requests done.
4494 requests done.
6897 requests done.
9128 requests done.
11535 requests done.
13812 requests done.
16137 requests done.
18489 requests done.
20855 requests done.
23177 requests done.
25540 requests done.
27813 requests done.
All requests done.

Summary:
  Total:	6.4688 secs
  Slowest:	0.0260 secs
  Fastest:	0.0015 secs
  Average:	0.0108 secs
  Requests/sec:	4637.6163
  Total data:	330000 bytes
  Size/request:	11 bytes

Status code distribution:
  [200]	30000 responses

Response time histogram:
  0.002 [1]	|
  0.004 [1]	|
  0.006 [3]	|
  0.009 [17]	|
  0.011 [21184]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.014 [7771]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.016 [792]	|∎
  0.019 [192]	|
  0.021 [21]	|
  0.024 [8]	|
  0.026 [10]	|

Latency distribution:
  10% in 0.0095 secs
  25% in 0.0095 secs
  50% in 0.0100 secs
  75% in 0.0120 secs
  90% in 0.0130 secs
  95% in 0.0135 secs
  99% in 0.0155 secs

---------1000 middlewares---------
Method -- GET: 
810 requests done.
1678 requests done.
2559 requests done.
3374 requests done.
4255 requests done.
5128 requests done.
5938 requests done.
6817 requests done.
7693 requests done.
8560 requests done.
9263 requests done.
10145 requests done.
10940 requests done.
11742 requests done.
12624 requests done.
13508 requests done.
14394 requests done.
15194 requests done.
16069 requests done.
16951 requests done.
17760 requests done.
18536 requests done.
19323 requests done.
20203 requests done.
20957 requests done.
21834 requests done.
22703 requests done.
23505 requests done.
24372 requests done.
25248 requests done.
26119 requests done.
26921 requests done.
27796 requests done.
28677 requests done.
29477 requests done.
All requests done.

Summary:
  Total:	17.8295 secs
  Slowest:	0.0660 secs
  Fastest:	0.0015 secs
  Average:	0.0297 secs
  Requests/sec:	1682.6067
  Total data:	330000 bytes
  Size/request:	11 bytes

Status code distribution:
  [200]	30000 responses

Response time histogram:
  0.002 [1]	|
  0.008 [0]	|
  0.014 [4]	|
  0.021 [10]	|
  0.027 [47]	|
  0.034 [27061]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.040 [1938]	|∎∎∎
  0.047 [565]	|∎
  0.053 [212]	|
  0.060 [140]	|
  0.066 [22]	|

Latency distribution:
  10% in 0.0275 secs
  25% in 0.0280 secs
  50% in 0.0285 secs
  75% in 0.0290 secs
  90% in 0.0330 secs
  95% in 0.0375 secs
  99% in 0.0485 secs

Method -- POST: 
838 requests done.
1698 requests done.
2477 requests done.
3328 requests done.
4110 requests done.
4891 requests done.
5724 requests done.
6543 requests done.
7417 requests done.
8202 requests done.
9080 requests done.
9962 requests done.
10753 requests done.
11618 requests done.
12486 requests done.
13329 requests done.
14152 requests done.
15021 requests done.
15888 requests done.
16662 requests done.
17507 requests done.
18382 requests done.
19145 requests done.
19986 requests done.
20863 requests done.
21716 requests done.
22511 requests done.
23333 requests done.
24158 requests done.
24940 requests done.
25776 requests done.
26625 requests done.
27428 requests done.
28183 requests done.
29041 requests done.
29904 requests done.
All requests done.

Summary:
  Total:	18.0806 secs
  Slowest:	0.0615 secs
  Fastest:	0.0030 secs
  Average:	0.0301 secs
  Requests/sec:	1659.2351
  Total data:	330000 bytes
  Size/request:	11 bytes

Status code distribution:
  [200]	30000 responses

Response time histogram:
  0.003 [1]	|
  0.009 [7]	|
  0.015 [7]	|
  0.021 [8]	|
  0.026 [56]	|
  0.032 [25737]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.038 [2552]	|∎∎∎∎
  0.044 [965]	|∎
  0.050 [351]	|∎
  0.056 [245]	|
  0.062 [71]	|

Latency distribution:
  10% in 0.0280 secs
  25% in 0.0280 secs
  50% in 0.0285 secs
  75% in 0.0295 secs
  90% in 0.0355 secs
  95% in 0.0390 secs
  99% in 0.0505 secs